000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DATEFR.
000210
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SPECIAL-NAMES.
000600     DECIMAL-POINT IS COMMA.
000610
000700 DATA DIVISION.
000800 WORKING-STORAGE SECTION.
000900*240515 - AAMMJJ
001000 01 WS-DATESYS.
001100    05 WS-AA PIC 99.
001200    05 WS-MM PIC 99.
001300    05 WS-JJ PIC 99.
001310
001400*LUNDI 24 JUIN 2024
001500 01 WS-DATE-LETTRE PIC X(26).
002010
002020*TABLEAU JOUR
002021 01 TABLEAU-JOUR.
002022    05 WS-LIBELLE-JOUR.
002028       10 FILLER  PIC X(8) VALUE 'LUNDI   '.
002029       10 FILLER  PIC X(8) VALUE 'MARDI   '.
002030       10 FILLER  PIC X(8) VALUE 'MERCREDI'.
002031       10 FILLER  PIC X(8) VALUE 'JEUDI   '.
002032       10 FILLER  PIC X(8) VALUE 'VENDREDI'.
002033       10 FILLER  PIC X(8) VALUE 'SAMEDI  '.
002034       10 FILLER  PIC X(8) VALUE 'DIMANCHE'.
002035    05 WS-NOM-JOUR REDEFINES WS-LIBELLE-JOUR.
002036       10 WS-JOUR-TAB PIC X(8) OCCURS 7 TIMES.
002037
002038*TABLEAU MOIS
002039 01 TABLEAU-MOIS.
002040    05 WS-LIBELLE-MOIS.
002050       10 FILLER  PIC X(9) VALUE 'JANVIER  '.
002051       10 FILLER  PIC X(9) VALUE 'FEVRIER  '.
002052       10 FILLER  PIC X(9) VALUE 'MARS     '.
002053       10 FILLER  PIC X(9) VALUE 'AVRIL    '.
002054       10 FILLER  PIC X(9) VALUE 'MAI      '.
002055       10 FILLER  PIC X(9) VALUE 'JUIN     '.
002056       10 FILLER  PIC X(9) VALUE 'JUILLET  '.
002057       10 FILLER  PIC X(9) VALUE 'AOUT     '.
002058       10 FILLER  PIC X(9) VALUE 'SEPTEMBRE'.
002059       10 FILLER  PIC X(9) VALUE 'OCTOBRE  '.
002060       10 FILLER  PIC X(9) VALUE 'NOVEMBRE '.
002061       10 FILLER  PIC X(9) VALUE 'DECEMBRE '.
002062    05 WS-NOM-MOIS REDEFINES WS-LIBELLE-MOIS.
002070       10 WS-MOIS-TAB PIC X(9) OCCURS 12 TIMES.
002080
002090 77 WS-POS     PIC  9.
002091
002100 LINKAGE SECTION.
002300 77 LS-DATE-FR PIC X(26).
002310
002400 PROCEDURE DIVISION USING LS-DATE-FR.
002510
002600     ACCEPT WS-DATESYS FROM DATE
003000
003001     ACCEPT WS-POS FROM DAY-OF-WEEK
003002*    WS-POS = POS JOUR SEMAINE (1:LUN, ...,  7:DIM)
003100
003500     STRING
003600       WS-JOUR-TAB(WS-POS) DELIMITED BY SPACE
003610       SPACE DELIMITED BY SIZE
003620       WS-JJ DELIMITED BY SIZE
003621       SPACE DELIMITED BY SIZE
003622       WS-MOIS-TAB(WS-MM) DELIMITED BY SPACE
003623       ' 20' DELIMITED BY SIZE
003630       WS-AA DELIMITED BY SIZE
003700       INTO WS-DATE-LETTRE
003701     END-STRING
003710
003711     MOVE WS-DATE-LETTRE TO LS-DATE-FR
003720
003730
003740
003800     GOBACK.
003900
004000
004100
004200
004300
004400
004500
004600
004700
004800
004900
005000
005100
005200
